### Imports

In [1]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

# Creating connection string using credential following this format
connection = "mysql+pymysql://root:root@localhost/movies"

### MySQL Connection

In [2]:
# Creating engine
engine = create_engine(connection)

In [3]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

### Loading Datasets

In [4]:
basics = pd.read_csv('Data/title_basics.csv.gz')
basics.head()

,tconst,titletype,primarytitle,originaltitle,isadult,startyear,endyear,runtimeminutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,np.nan,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,np.nan,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,np.nan,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,np.nan,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,np.nan,126,Drama

In [5]:
ratings = pd.read_csv('Data/title_rating.csv.gz')
ratings.head()

      tconst  averagerating  numvotes
0  tt0000001            5.7      1971
1  tt0000002            5.8       263
2  tt0000005            6.2      2612
3  tt0000006            5.1       181
4  tt0000007            5.4       818

In [6]:
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.117,2195.0,PG

### Cleaning the Datasets

#### Cleaning Basics Dataset

In [7]:
# Changing the basics dataframe to include the requested tables:
# Move ID(tconst), Primary Title, Start Year, Runtime(in Minutes), Genres
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81720 entries, 0 to 81719
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81720 non-null  object
 1   titletype       81720 non-null  object
 2   primarytitle    81720 non-null  object
 3   originaltitle   81720 non-null  object
 4   isadult         81720 non-null  int64
 5   startyear       81720 non-null  float64
 6   endyear         81720 non-null  object
 7   runtimeminutes  81720 non-null  int64
 8   genres          81720 non-null  object
dtypes: float64(1), int64(2), object(6)
memory usage: 5.6+ MB

In [8]:
# Dropping unnecessary columns
basics = basics.drop(columns=['titletype', 
                              'originaltitle', 
                              'isadult',
                              'endyear'])
# Checking if it changed 
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81720 entries, 0 to 81719
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81720 non-null  object
 1   primarytitle    81720 non-null  object
 2   startyear       81720 non-null  float64
 3   runtimeminutes  81720 non-null  int64
 4   genres          81720 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 3.1+ MB

The data is now cleaned and ready for transformation/normalization

### Cleaning Rating Dataset

In [9]:
# Changing the ratings dataframe to include the requested tables:
# Movie ID(tconst), Average Movie Rating, Number of Votes
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 498034 entries, 0 to 498033
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         498034 non-null  object
 1   averagerating  498034 non-null  float64
 2   numvotes       498034 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.4+ MB

Requested columns are already there. This data is now ready for transformation/normalization.

### Cleaning TMDB Dataset

In [10]:
# Changing the tmdb dataframe to include the requested tables:
# Movie ID, Revenue, Budget, Certification(MPAA Rating)
tmdb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2568 entries, 0 to 2567
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2568 non-null   object
 1   adult                  2566 non-null   float64
 2   backdrop_path          1397 non-null   object
 3   belongs_to_collection  205 non-null    object
 4   budget                 2566 non-null   float64
 5   genres                 2566 non-null   object
 6   homepage               172 non-null    object
 7   id                     2566 non-null   float64
 8   original_language      2566 non-null   object
 9   original_title         2566 non-null   object
 10  overview               2516 non-null   object
 11  popularity             2566 non-null   float64
 12  poster_path            2308 non-null   object
 13  production_companies   2566 non-null   object
 14  production_countries   2566 non-null   object
 15  release_date           2547 non-null   object
 16  revenue                2566 non-null   float64
 17  runtime                2566 non-null   float64
 18  spoken_languages       2566 non-null   object
 19  status                 2566 non-null   object
 20  tagline                1101 non-null   object
 21  title                  2566 non-null   object
 22  video                  2566 non-null   float64
 23  vote_average           2566 non-null   float64
 24  vote_count             2566 non-null   float64
 25  certification          816 non-null    object
dtypes: float64(9), object(17)
memory usage: 521.8+ KB

In [11]:
# Looking over the data what are the values for imdb_id and id and whether it 
# matches the necessary Movie ID column
basics['tconst'].value_counts()

tt0035423     1
tt3547466     1
tt3547900     1
tt3547782     1
tt3547740     1
             ..
tt1387141     1
tt13871408    1
tt13871402    1
tt13871364    1
tt9916362     1
Name: tconst, Length: 81720, dtype: int64

In [12]:
# Checking imdb_id
tmdb['imdb_id'].value_counts()

0            2
tt0245356    1
tt0252299    1
tt0252480    1
tt0252501    1
            ..
tt0251756    1
tt0252327    1
tt0252335    1
tt0252445    1
tt9071078    1
Name: imdb_id, Length: 2567, dtype: int64

In [13]:
# Checking id
tmdb['id'].value_counts()

62127.0     1
61016.0     1
9104.0      1
15192.0     1
11313.0     1
           ..
166255.0    1
93690.0     1
140101.0    1
270625.0    1
201706.0    1
Name: id, Length: 2566, dtype: int64

In [14]:
# Adding the requested data to a new dataframe. Excluding the id column 
tmdb2 = tmdb[['imdb_id', 'revenue', 'budget', 'certification']]
# Checking to see if the change took place
tmdb2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2568 entries, 0 to 2567
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2568 non-null   object
 1   revenue        2566 non-null   float64
 2   budget         2566 non-null   float64
 3   certification  816 non-null    object
dtypes: float64(2), object(2)
memory usage: 80.4+ KB

In [15]:
tmdb2.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

In [16]:
tmdb2.drop(labels=0, axis=0, inplace=True)
tmdb2.head()

C:\Users\amnam\AppData\Local\Temp\ipykernel_22012\3141987639.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tmdb2.drop(labels=0, axis=0, inplace=True)

     imdb_id     revenue      budget certification
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG
5  tt0118852         0.0         0.0             R

### Normalizing the Data

In [17]:
## Create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,primarytitle,startyear,runtimeminutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,Crime and Punishment,2002.0,126,Drama,[Drama]
...,...,...,...,...,...,...
81715,tt9914942,Life Without Sara Amat,2019.0,74,Drama,[Drama]
81716,tt9915872,The Last White Witch,2019.0,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81717,tt9916170,The Rehearsal,2019.0,51,Drama,[Drama]
81718,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81719,tt9916362,Coven,2020.0,92,"Drama,History","[Drama, History]"

In [18]:
# Exploding the series using .explode() and taking the .unique() entries only
exploded_genres = exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,primarytitle,startyear,runtimeminutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,Drama
...,...,...,...,...,...,...
81718,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Action
81718,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Adventure
81718,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Thriller
81719,tt9916362,Coven,2020.0,92,"Drama,History",Drama
81719,tt9916362,Coven,2020.0,92,"Drama,History",History

In [19]:
# Now getting the unique values from the genres_split column
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [20]:
# Creating a new table/dataframe, title_genres from the exploded dataframe
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [21]:
# Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [22]:
# Making new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [23]:
# Creating a dataframe with named cols from the .keyd and .values
genre_lookup = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [24]:
# Dropping the genres_split column
basics.drop(columns='genres_split', inplace=True)
# Checking if the column was dropped
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81720 entries, 0 to 81719
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81720 non-null  object
 1   primarytitle    81720 non-null  object
 2   startyear       81720 non-null  float64
 3   runtimeminutes  81720 non-null  int64
 4   genres          81720 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 3.1+ MB

### Saving Dataset to SQL

In [25]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primarytitle'].fillna('').map(len).max()
genre_name_len = genre_lookup['genre_name'].fillna('').map(len).max()
certification_len = tmdb2['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    'tconst': String(key_len+1), 'primarytitle': Text(title_len+1),
    'startyear': Float(), 'runtimeminutes': Integer(),
    'averagerating': Float(), 'numvotes': Integer(),
    'genre_id': Integer(), 'genre_name': Text(genre_name_len+1),
    'imdb_id': String(key_len+1), 'revenue': Float(),
    'budget': Float(), 'certification': Text(certification_len+1)}

In [26]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

81720

In [27]:
# Checking to see if the table was added
b = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(b, engine)

,tconst,primarytitle,startyear,runtimeminutes,genres
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama
3,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002.0,126,Drama

In [28]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)

498034

In [29]:
# Checking to see if the table was added
r = """SELECT * FROM title_ratings LIMIT 5;"""
pd.read_sql(r, engine)

      tconst  averagerating  numvotes
0  tt0000001            5.7      1971
1  tt0000002            5.8       263
2  tt0000005            6.2      2612
3  tt0000006            5.1       181
4  tt0000007            5.4       818

In [30]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)

153113

In [31]:
# Checking to see if the table was added
t = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(t, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [32]:
# Save to sql with dtype and index=False
genre_lookup.to_sql('genres',engine,dtype=df_schema,if_exists='replace',index=False)

26

In [33]:
# Checking to see if the table was added
l = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(l, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [34]:
# Save to sql with dtype and index=False
tmdb2.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

2567

In [35]:
# Checking to see if the table was added
t2 = """SELECT * FROM tmdb_data LIMIT 5;"""
pd.read_sql(t2, engine)

     imdb_id     revenue      budget certification
0  tt0113026         0.0  10000000.0          None
1  tt0113092         0.0         0.0          None
2  tt0116391         0.0         0.0          None
3  tt0118694  12855000.0    150000.0            PG
4  tt0118852         0.0         0.0             R

### Adding Primary Keys

In [36]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [37]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [38]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [39]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

### Checking the Database

In [40]:
# Checking if all tables loaded correctly
a = """SHOW TABLES;"""
pd.read_sql(a, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data